


[
    {
      "name": "能耗02",
      "values": {
        "20180106": 0,
        "20180107": 0,
        "20180108": 0,
        "20180109": 0,
        "20180110": 0,
        "20180111": 0,
        "20180112": 0
      }
    }
  ]

[{
    name: '能耗02',
    marker: {
        enabled: true,
        radius: 3
    },
    color: '#A4CD52',
    data: [
        [1515196800000, 0],
        [1515283200000, 0],
        [1515369600000, 0],
        [1515456000000, 0],
        [1515542400000, 0],
        [1515628800000, 0],
        [1515715200000, 0]
    ]
}]



var  getAnalysisHighcharData; //获取图表数据

var data = {
    type:'btn_filter',//按钮筛选
    type:'chart_time_filter',//图表时间筛选
    type:'chart_type_filter',//图表类型筛选
    
}